-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- 호스트: localhost
-- 생성 시간: 25-11-04 14:15
-- 서버 버전: 10.4.6-MariaDB
-- PHP 버전: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `yehan`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `calendar_background`
--

CREATE TABLE `calendar_background` (
  `id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `month` int(11) NOT NULL,
  `image_url` varchar(255) NOT NULL,
  `opacity` float DEFAULT 0.3,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `calendar_background`
--

INSERT INTO `calendar_background` (`id`, `year`, `month`, `image_url`, `opacity`, `created_at`) VALUES
(1, 2025, 9, 'https://gongu.copyright.or.kr/gongu/wrt/cmmn/wrtFileImageView.do?wrtSn=11288960&filePath=L2Rpc2sxL25ld2RhdGEvMjAxNS8wMi9DTFM2OS9OVVJJXzAwMV8wNDQ2X251cmltZWRpYV8yMDE1MTIwMw==&thumbAt=Y&thumbSe=b_tbumb&wrtTy=10006', 0.3, '2025-10-27 15:26:26'),
(2, 2025, 8, 'https://cdnweb01.wikitree.co.kr/webdata/editor/202505/08/img_20250508125026_079da232.webp', 0.3, '2025-10-27 15:30:05'),
(3, 2025, 7, 'https://plus.unsplash.com/premium_photo-1681437096361-c5f1e29d6997?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8JUVDJTk3JUFDJUVCJUE2JTg0JTIwJUVCJUIwJUIwJUVBJUIyJUJEJUVEJTk5JTk0JUVCJUE5JUI0fGVufDB8fDB8fHww&fm=jpg&q=60&w=3000', 0.3, '2025-10-27 15:31:09'),
(4, 2025, 10, 'https://blog.kakaocdn.net/dna/bTTQ9Z/btsNMutaQcU/AAAAAAAAAAAAAAAAAAAAAFG91ZsrZNCF0Frg_oRyhUIMTds_3gfh4avWcQyY8-lX/img.webp?credential=yqXZFxpELC7KVnFOS48ylbz2pIh7yKj8&expires=1761922799&allow_ip=&allow_referer=&signature=KOr9bvx1db%2B46FnmpkXtLxwZOcE%3D', 0.3, '2025-10-27 15:32:12'),
(5, 2025, 11, 'http://localhost/pages/uploads/bg_68ff933b3a2b10.63051747.jpg', 0.3, '2025-10-27 15:39:22');

-- --------------------------------------------------------

--
-- 테이블 구조 `calendar_event`
--

CREATE TABLE `calendar_event` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `event_date` date NOT NULL,
  `repeat_annually` tinyint(1) DEFAULT 0,
  `color` varchar(20) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `calendar_event`
--

INSERT INTO `calendar_event` (`id`, `title`, `event_date`, `repeat_annually`, `color`, `created_at`) VALUES
(5, '박경희', '2025-10-13', 1, '#0000ff', '2025-10-27 13:52:58'),
(6, '오현아', '2025-10-10', 1, '#0000ff', '2025-10-27 13:53:07'),
(7, '임준혁/이다솜 결혼기념일', '2025-10-31', 1, '#32c759', '2025-10-27 13:53:32'),
(8, '심진섭/최수정 결혼기념일', '2025-11-11', 1, '#32c759', '2025-10-27 13:53:57'),
(9, '조예은', '2025-11-08', 1, '#0161fd', '2025-10-27 13:54:08'),
(10, '임준혁', '2025-11-20', 1, '#0161fd', '2025-10-27 13:54:20'),
(11, '조호연', '2025-12-14', 1, '#0161fd', '2025-10-27 13:54:37'),
(12, '교회설립기념일', '2025-12-16', 1, '#ffcc02', '2025-10-27 13:54:55'),
(13, '김유진', '2025-12-27', 1, '#0161fd', '2025-10-27 13:55:08'),
(14, '햇살이', '2025-12-22', 1, '#0161fd', '2025-10-27 13:55:43'),
(15, '최수정', '2025-01-09', 1, '#0161fd', '2025-10-27 13:56:10'),
(16, '배아영', '2025-01-26', 1, '#0161fd', '2025-10-27 13:56:33'),
(17, '김선종', '2025-01-16', 1, '#0161fd', '2025-10-27 13:56:43'),
(18, '조수호', '2025-02-10', 1, '#0161fd', '2025-10-27 13:57:00'),
(19, '조수호/김유진 결혼기념일', '2025-02-25', 1, '#32c759', '2025-10-27 13:57:11'),
(20, '이예슬', '2025-02-20', 1, '#0000ff', '2025-10-27 13:58:13'),
(21, '김지아', '2025-03-30', 1, '#0000ff', '2025-10-27 13:58:34'),
(22, '배준석/박정미 결혼기념일', '2025-04-10', 1, '#32c759', '2025-10-27 13:58:56'),
(23, '김선종/이예슬 결혼기념일', '2025-04-27', 1, '#32c759', '2025-10-27 13:59:10'),
(24, '조아연', '2025-05-02', 1, '#0161fd', '2025-10-27 13:59:32'),
(25, '심진섭', '2025-05-09', 1, '#0161fd', '2025-10-27 13:59:43'),
(26, '박정미', '2025-05-09', 0, '#0161fd', '2025-10-27 13:59:50'),
(27, '심서연', '2025-05-24', 1, '#0161fd', '2025-10-27 14:00:01'),
(28, '박민서', '2025-06-23', 1, '#0161fd', '2025-10-27 14:00:15'),
(29, '조서연', '2025-06-29', 1, '#0161fd', '2025-10-27 14:00:21'),
(30, '배준석', '2025-06-30', 1, '#0161fd', '2025-10-27 14:00:28'),
(31, '배하영', '2025-08-01', 1, '#0161fd', '2025-10-27 14:00:40'),
(32, '김지온', '2025-09-15', 1, '#0161fd', '2025-10-27 14:00:51'),
(33, '이다솜', '2025-09-22', 1, '#0161fd', '2025-10-27 14:00:57'),
(34, '김지유', '2025-04-22', 1, '#0161fd', '2025-10-27 14:01:07'),
(37, '추석', '2025-10-05', 0, '#ff0000', '2025-10-27 14:54:12'),
(38, '추석', '2025-10-06', 0, '#ff0000', '2025-10-27 14:54:14'),
(39, '추석', '2025-10-07', 0, '#ff0000', '2025-10-27 14:54:17'),
(40, '추석', '2025-10-08', 0, '#ff0000', '2025-10-27 14:54:20'),
(42, '광복절', '2025-08-15', 1, '#ff0000', '2025-10-27 14:55:08'),
(43, '21대 대통령선거', '2025-06-03', 0, '#ff0000', '2025-10-27 14:55:31'),
(44, '현충일', '2025-06-06', 1, '#ff0000', '2025-10-27 14:55:42'),
(45, '어린이날', '2025-05-05', 1, '#ff0000', '2025-10-27 14:55:51'),
(46, '석가탄신일', '2025-05-05', 0, '#ff0000', '2025-10-27 14:56:01'),
(47, '대체공휴일', '2025-05-06', 0, '#ff0000', '2025-10-27 14:56:07'),
(48, '삼일절', '2025-03-01', 1, '#ff0000', '2025-10-27 14:56:19'),
(49, '대체공휴일', '2025-03-03', 0, '#ff0000', '2025-10-27 14:56:24'),
(50, '설날', '2025-01-27', 0, '#ff0000', '2025-10-27 14:56:39'),
(51, '설날', '2025-01-28', 0, '#ff0000', '2025-10-27 14:56:41'),
(52, '설날', '2025-01-29', 0, '#ff0000', '2025-10-27 14:56:42'),
(53, '설날', '2025-01-30', 0, '#ff0000', '2025-10-27 14:56:43'),
(54, '신정', '2025-01-01', 1, '#ff0000', '2025-10-27 14:57:13'),
(55, '성탄절', '2025-12-25', 1, '#ff0000', '2025-10-27 14:58:31'),
(56, '설날', '2026-02-16', 0, '#ff0000', '2025-10-27 14:59:07'),
(57, '설날', '2026-02-17', 0, '#ff0000', '2025-10-27 14:59:10'),
(58, '설날', '2026-02-18', 0, '#ff0000', '2025-10-27 14:59:12'),
(59, '대체공휴일', '2026-03-02', 0, '#ff0000', '2025-10-27 14:59:46'),
(60, '대체공휴일', '2026-05-25', 0, '#ff0000', '2025-10-27 15:00:18'),
(61, '석가탄신일', '2026-05-24', 0, '#ff0000', '2025-10-27 15:00:23'),
(62, '예은자매 결혼식', '2026-07-04', 0, '#73ff00', '2025-10-27 15:00:50'),
(63, '현아자매 결혼식', '2025-12-20', 0, '#73ff00', '2025-10-27 15:01:11'),
(64, '대체공휴일', '2026-08-17', 0, '#ff0000', '2025-10-27 15:01:27'),
(65, '추석', '2026-09-24', 0, '#ff0000', '2025-10-27 15:01:38'),
(66, '추석', '2026-09-25', 0, '#ff0000', '2025-10-27 15:01:39'),
(67, '추석', '2026-09-26', 0, '#ff0000', '2025-10-27 15:01:42'),
(68, '대체공휴일', '2026-10-05', 0, '#ff0000', '2025-10-27 15:01:54'),
(69, '한글날', '2026-10-09', 1, '#ff0000', '2025-10-27 15:02:16'),
(70, '개천절', '2026-10-03', 1, '#ff0000', '2025-10-27 15:03:24'),
(71, '설날', '2027-02-06', 1, '#ff0000', '2025-10-27 15:04:03'),
(72, '설날', '2027-02-07', 1, '#ff0000', '2025-10-27 15:04:05'),
(73, '설날', '2027-02-08', 1, '#ff0000', '2025-10-27 15:04:07'),
(74, '석가탄신일', '2027-05-13', 0, '#ff0000', '2025-10-27 15:04:48'),
(75, '추석', '2027-09-14', 0, '#ff0000', '2025-10-27 15:05:28'),
(76, '추석', '2027-09-15', 0, '#ff0000', '2025-10-27 15:05:30'),
(77, '추석', '2027-09-16', 0, '#ff0000', '2025-10-27 15:05:31');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `calendar_background`
--
ALTER TABLE `calendar_background`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `year_month_unique` (`year`,`month`);

--
-- 테이블의 인덱스 `calendar_event`
--
ALTER TABLE `calendar_event`
  ADD PRIMARY KEY (`id`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `calendar_background`
--
ALTER TABLE `calendar_background`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 테이블의 AUTO_INCREMENT `calendar_event`
--
ALTER TABLE `calendar_event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
